package fun.wk.random;

import org.junit.Test;

public class RandomCharacterName {
	//298个单姓
	private static String[] singleSurnames = { 
			"李", "王", "张", "刘", "陈", "杨", "赵", "黄", "周", "吴", "徐", "孙", "胡", "朱", "高", "林", "何", "郭", "马", "罗", "梁",
			"宋", "郑", "谢", "韩", "唐", "冯", "于", "董", "萧", "程", "曹", "袁", "邓", "许", "傅", "沉", "曾", "彭", "吕", "苏", "卢",
			"蒋", "蔡", "贾", "丁", "魏", "薛", "叶", "阎", "余", "潘", "杜", "戴", "夏", "钟", "汪", "田", "任", "姜", "范", "方", "石",
			"姚", "谭", "廖", "邹", "熊", "金", "陆", "郝", "孔", "白", "崔", "康", "毛", "邱", "秦", "江", "史", "顾", "侯", "邵", "孟",
			"龙", "万", "段", "漕", "钱", "汤", "尹", "黎", "易", "常", "武", "乔", "贺", "赖", "龚", "文", "庞", "樊", "兰", "殷", "施",
			"陶", "洪", "翟", "安", "颜", "倪", "严", "牛", "温", "芦", "季", "俞", "章", "鲁", "葛", "伍", "韦", "申", "尤", "毕", "聂",
			"丛", "焦", "向", "柳", "邢", "路", "岳", "齐", "沿", "梅", "莫", "庄", "辛", "管", "祝", "左", "涂", "谷", "祁", "时", "舒",
			"耿", "牟", "卜", "詹", "关", "苗", "凌​​", "费", "纪", "靳", "盛", "童", "欧", "甄", "项", "曲", "成", "游", "阳", "裴", "席",
			"卫", "查", "屈", "鲍", "位", "覃", "霍", "翁", "隋", "植", "甘", "景", "薄", "单", "包", "司", "柏", "宁", "柯", "阮", "桂",
			"闵", "解", "强", "柴", "华", "车", "冉", "房", "边", "辜", "吉", "饶", "刁", "瞿", "戚", "丘", "古", "米", "池", "滕", "晋",
			"苑", "邬", "臧", "畅", "宫", "来", "嵺", "苟", "全", "褚", "廉", "简", "娄", "盖", "符", "奚", "木", "穆", "党", "燕", "郎",
			"邸", "冀", "谈", "姬", "屠", "连", "郜", "晏", "栾", "郁", "商", "蒙", "计", "喻", "揭", "窦", "迟", "宇", "敖", "糜", "鄢",
			"冷", "卓", "花", "仇", "艾", "蓝", "都", "巩", "稽", "井", "练", "仲", "乐", "虞", "卞", "封", "竺", "冼", "原", "官", "衣",
			"楚", "佟", "栗", "匡", "宗", "应", "台", "巫", "鞠", "僧", "桑", "荆", "谌", "银", "扬", "明", "沙", "薄", "伏", "岑", "习",
			"胥", "保", "和", "蔺" };
	//81个复姓
	private static String[] compoundSurnames = {
			"欧阳", "太史", "端木", "上官", "司马", "东方", "独孤", "南宫", "万俟", "闻人", "夏侯", "诸葛", "尉迟", "公羊", "赫连", "澹台", "皇甫", "宗政",
			"濮阳", "公冶", "太叔", "申屠", "公孙", "慕容", "仲孙", "钟离", "长孙", "宇文", "司徒", "鲜于", "司空", "闾丘", "子车", "亓官", "司寇", "巫马",
			"公西", "颛孙", "壤驷", "公良", "漆雕", "乐正", "宰父", "谷梁", "拓跋", "夹谷", "轩辕", "令狐", "段干", "百里", "呼延", "东郭", "南门", "羊舌",
			"微生", "公户", "公玉", "公仪", "梁丘", "公仲", "公上", "公门", "公山", "公坚", "左丘", "公伯", "西门", "公祖", "第五", "公乘", "贯丘", "公皙",
			"南荣", "东里", "东宫", "仲长", "子书", "子桑", "即墨", "达奚", "褚师" };
	
	//普通名字
	private static String[] nomalNames={
			"怡君", "雅婷", "欣怡", "雅雯", "家豪", "怡婷", "宗翰", "雅惠", "志豪", "心怡", "建宏", "佳蓉", "佩珊", "静怡", "志伟", "雅玲", "佩君", "俊宏",
			"佳颖", "怡伶", "婉婷", "俊杰", "郁婷", "怡如", "钰婷", "静宜", "彦廷", "冠宇", "佳玲", "诗婷", "家玮", "承翰", "诗涵", "佳慧", "惠雯", "宜君",
			"雅琪", "雅文", "柏翰", "韵如", "思颖", "俊贤", "玉婷", "淑芬", "琬婷", "家铭", "怡静", "冠廷", "雅萍", "怡萱", "信宏", "婷婷", "惠婷", "淑娟",
			"馨仪", "威廷", "雅慧", "淑惠", "佩蓉", "哲玮", "智伟", "淑婷", "宜芳", "佳桦", "珮瑜", "嘉玲", "依婷", "雅芳", "欣仪", "慧君", "芳瑜", "俊豪",
			"宗宪", "哲维", "志宏", "家瑜", "雅涵", "宜静", "筱婷", "佳琪", "怡文", "淑君", "郁雯", "冠宏", "士豪", "惠君", "家荣", "嘉宏", "伟伦", "雅筑",
			"怡洁", "慧玲", "佩玲", "欣颖", "建志", "惠如", "雅君", "明哲", "怡安", "孟儒", "于婷", "俊宇", "美玲", "欣宜", "俊廷", "志鸿", "彦君", "宗霖",
			"芳仪", "俊毅", "怡慧", "玮婷", "佩璇", "美君", "珮君", "建良", "政宏", "建铭", "柏宏", "志强", "雅琳", "佳雯", "惠玲", "仁杰", "书豪", "志铭",
			"淑玲", "智凯", "盈君", "思妤", "佳霖", "士杰", "智翔", "建宇", "婉如", "淑萍", "子豪", "伟哲", "凯翔", "文杰", "建勋", "博文", "筱涵", "淑华",
			"彦宏", "郁涵", "佳欣", "志远", "怡璇", "嘉慧", "佳伶", "宇轩", "嘉文", "玉玲", "俊凯", "思婷", "千惠", "雅芬", "建豪", "莉婷", "立伟", "志明",
			"怡菁", "淑贞", "静雯", "家宏", "淑慧", "明宏", "怡芳", "舒婷", "雅茹", "书玮", "俊佑", "冠霖", "怡雯", "俊铭", "建智", "雅如", "哲宇", "佩颖",
			"宜蓁", "姿吟", "宜珊", "家维", "柏勋", "凯文", "佩芬", "建文", "明翰", "怡秀", "惠文", "佳容", "人豪", "宗颖", "筱雯", "婉君", "雅铃", "智杰",
			"佳怡", "凯婷", "文彦", "世伟", "俊良", "俊彦", "欣桦", "彦儒", "育诚", "蕙如", "文豪", "琼文", "伊婷", "俊玮", "思涵", "哲豪", "嘉琪", "芳如",
			"姿君", "家伟", "姿颖", "佩桦", "慧如", "圣文", "文馨", "郁文", "慧雯", "秀玲", "怡欣", "嘉伟", "怡均", "馨慧", "婉瑜", "英杰", "佳君", "怡萍",
			"静仪", "美惠", "彦霖", "振宇", "政翰", "家慧", "佳芳", "文彬", "佳莹", "宜臻", "俊男", "明宪", "柏毅", "家庆", "韦廷", "姿莹", "建廷", "姿伶",
			"美慧", "佩怡", "安琪", "佳静", "慧娟", "欣洁", "镇宇", "柏廷", "千慧", "盈如", "珮如", "慧婷", "志玮", "子翔", "昱廷", "淑芳", "建成", "柏宇",
			"宜庭", "佳惠", "靖雯", "慧珊", "威志", "彦良", "志成", "晓雯", "佳宏", "建中", "维伦", "子轩", "承恩", "俊德", "凯杰", "宗贤", "宜婷", "彦伶",
			"惠茹", "建安", "俊霖", "哲铭", "文君", "育如", "家齐", "志文", "珮绮", "怡臻", "建霖", "佩芳", "孟君", "宜真", "圣杰", "庭玮", "乃文", "君豪",
			"玉如", "孟颖", "淑敏", "威宇", "秋萍", "俊达", "宜桦", "美芳", "佳仪", "伟诚", "可欣", "嘉鸿", "文凯", "家华", "世豪", "志杰", "世杰", "舒涵",
			"文婷", "志忠", "姵君", "雯婷", "雅岚", "秀娟", "淑媛", "家弘", "佩宜", "政达", "政勋", "佩真", "嘉惠", "意婷", "世昌", "育贤", "宗儒", "慧敏",
			"怡蓁", "宜洁", "郁芬", "冠伶", "佩娟", "佳燕", "丽君", "孟洁", "珮雯", "惠萍", "姿蓉", "淑雯", "宛蓉", "雅菁", "琼慧", "惠敏", "世杰", "珮珊",
			"冠颖", "嘉雯", "静芳", "国豪", "怡廷", "志贤", "孟哲", "静如", "正伟", "佩琪", "毓婷", "明勋", "佩瑜", "晓君", "依洁", "佳琳", "育玮", "明慧",
			"俊伟", "怡桦", "美娟", "子杰", "志龙", "宛儒", "玉芳", "冠儒", "孟翰", "伟翔", "怡芬", "逸群", "奕廷", "家祥", "柏豪", "博仁", "怡真", "念慈",
			"孟勋", "柏翔", "惠娟", "玫君", "国维", "竹君", "美如", "于庭", "彦翔", "雅淳", "伟豪", "晓薇", "佳芬", "家贤", "韦伶", "宛真", "佩仪", "佳芸",
			"晓婷", "玮伦", "湘婷", "钰雯", "孟轩", "丽娟", "珮甄", "维哲", "佳儒", "伟杰", "于珊", "莉雯", "宗佑", "淑真", "智仁", "伟铭", "佩如", "佳宜",
			"嘉豪", "思洁", "志维", "仁豪", "柏均", "玉珊", "怡华", "玮玲", "慧萍", "柏钧", "丽雯", "政宪", "俊谚", "耀文", "家绮", "建华", "孟璇", "姿仪",
			"欣蓉", "欣瑜", "彦豪", "佩雯", "巧玲", "佳勋", "智文", "韵婷", "柏霖", "佳纯", "圣凯", "建佑", "国华", "珮琪", "美伶", "蕙君", "佳真", "婉菁",
			"佳蓁", "雅欣", "宇翔", "彦文", "明峰", "婉玲", "玉芬", "育德", "雅馨", "欣慧", "俊杰", "政霖", "思翰", "倩如", "佩芸", "彦志", "韦志", "建兴",
			"志宇", "明达", "宗勋", "子扬", "士贤", "馨文", "凯钧", "柏凱", "盈洁", "彦甫", "晓玲", "雅晴", "佩莹", "彦宇", "美华", "如君", "俊翰", "志诚",
			"文贤", "明伦", "怡蓉", "慧茹", "子涵", "裕翔", "慧真", "冠杰", "思贤", "宏伟", "晓菁", "怡珊", "婉茹", "姿婷", "思莹", "明志", "鸿文", "盈秀",
			"俊荣", "弘毅", "欣儒", "智豪", "郁珊", "东霖", "佩儒", "于萱", "育民", "文琪", "明贤", "育菁", "琼仪", "婕妤", "耀仁", "郁茹", "育铭", "彦均",
			"依璇", "政纬", "孟桦", "育慈", "静芬", "姿妤", "俊颖", "淑如", "思桦", "俊纬", "育瑄", "文宏", "玟君", "筱薇", "文正", "柏谚", "健铭", "依玲",
			"文", "俊翔", "俊仁", "宜玲", "诗怡", "俐君", "家琪", "立婷", "彦勋", "士哲", "宗哲", "建玮", "俊维", "冠文", "智钧", "俊嘉", "郁翔", "书铭",
			"俊安", "志轩", "冠华", "明儒", "俊明", "志杰", "佳瑜", "秀慧", "家欣", "国玮", "景翔", "智尧", "怡颖", "柏玮", "育萱", "健豪", "秉勋", "建德",
			"峻玮", "玉娟", "柏元", "明轩", "宗达", "家莹", "佳璇", "宜萱", "致远", "筱芸", "淑卿", "明芳", "晓萍", "子瑜", "香君", "思吟", "钰涵", "育霖",
			"耀德", "彦铭", "冠中", "怡莹", "诗雅", "宜欣", "冠豪", "亭君", "峻豪", "怡瑄", "志祥", "志峰", "家纬", "怡嘉", "筱君", "逸轩", "依萍", "岳霖",
			"逸凡", "玉萍", "慧芳", "贞仪", "宛臻", "哲纬", "书维", "俊逸", "淑珍", "明洁", "婉甄", "雨洁", "慧珍", "思慧", "伟智", "玮", "晓琪", "慧贞",
			"心瑜", "冠桦", "丽如", "振豪", "昱宏", "立群", "郁芳", "雅云", "政哲", "哲伟", "靖雅", "国荣", "佩伶", "彦如", "怡祯", "秀雯", "俊吉", "欣妤",
			"宏达", "佳伦", "雅钧", "大为", "玟伶", "孟珊", "宜芬", "志荣", "婷", "俊成", "柏青", "文怡", "佳臻", "晓慧", "佳吟", "政贤", "庭瑜", "宜璇",
			"玉雯", "文欣", "文斌", "佳珍", "嘉琳", "彦钧", "郁欣", "珮慈", "馨莹", "柏安", "彦婷", "永昌", "宗桦", "哲民", "育豪", "晓芬", "怡妏", "智超",
			"明德", "敏华", "耀中", "明辉", "启宏", "建邦", "建明", "佩欣", "雅莉", "易霖", "宜颖", "国峰", "淑怡", "秀如", "静慧", "尚儒", "惠琪", "秋燕",
			"雅娟", "嘉莹", "志翔", "秉翰", "俊儒", "文祥", "国伟", "宁", "俊宪", "凯元", "慧文", "晏如", "志仁", "静茹", "美琪", "嘉祥", "安妮", "惠珍",
			"博凯", "冠仪", "凤仪", "家兴", "博元", "明杰", "俊雄", "家祯", "维真", "雅云", "伟志", "玮珊", "淑美", "诗颖", "珮瑄", "婕", "宗佑", "志扬",
			"彦博", "政谚", "裕仁", "信豪", "铭鸿", "文华", "俊龙", "昱翔", "建璋", "凯琳", "士弘", "欣如", "力玮", "咏翔", "奕君", "伟成", "博钧", "建荣",
			"宏仁", "金龙", "哲安", "惠菁", "瑞鸿", "冠甫", "怡玲", "佩吟", "诗雯", "大维", "嘉骏", "惠珊", "政儒", "柏志", "智强", "永祥", "昆霖", "汉威",
			"文龙", "嘉伦", "胜杰", "育正", "俐伶", "建彰", "育廷", "佳琦", "怡贞", "家诚", "凯雯", "冠良", "家宁", "彦伯", "于真", "淑雅", "晋嘉", "婉柔",
			"佩萱", "景文", "嘉芸", "思齐", "虹君", "孟修", "玉菁", "怡儒", "秀芬", "宜儒", "懿萱", "宏铭", "奕安", "怡青", "伟民", "冠玮", "秀婷", "家仪",
			"承勋", "依珊", "建忠", "书瑜", "建男", "婉琳", "妍伶", "心仪", "宏文", "瑜珊", "信良", "盈盈", "鼎钧", "孟婷", "佩容", "世明", "宜珍", "致豪",
			"淑仪", "子芸", "美吟", "孟蓉", "智勇", "淑铃", "玉洁", "奕辰", "育儒", "佳鸿", "巧雯", "彦杰", "明宗", "嘉芳", "欣蓓", "士铭", "嘉仁", "诗芸",
			"怡珍", "佩茹", "婉萍", "宗毅", "世贤", "俞君", "彦佑", "柏仁", "柏儒", "丽婷", "明璋", "建桦", "宜轩", "郁仁", "建纬", "铭宏", "孟娟", "志坚",
			"珊珊", "宜慧", "佳盈", "筱筠", "佳翰", "育嘉", "仁宏", "逸婷", "信安", "士轩", "思嘉", "珮茹", "惠芳", "文政", "文心", "宛君", "雅琴", "英哲",
			"瑞祥", "志雄", "慧怡", "嘉庆", "建甫", "奕翔", "政颖", "书贤", "明君", "怡宁", "孟芳", "杰", "凯伦", "筱筑", "宛玲", "允中", "玉琳", "启铭",
			"美仪", "育婷", "佳音", "佳恩", "明修", "震宇", "宜蓉", "威任", "昱辰", "宏儒", "政伟", "育维", "自强", "明颖", "丽华", "文志", "婉真", "竣杰",
			"柏辰", "哲嘉", "伟婷", "嘉容", "宛庭", "仲豪", "家源", "廷宇", "玉华", "圣翔", "品洁", "淑菁", "子维", "盈莹", "晓岚", "君仪", "子婷", "柏成",
			"宛婷", "钰翔", "婉琪", "昱豪", "惠美", "志鹏", "圣哲", "亚璇", "明鸿", "维仁", "柏村", "铭哲", "珮玲", "大钧", "薇如", "智玮", "依静", "耀贤",
			"美秀", "晓涵", "志平", "育仁", "韦翔", "秀芳", "柏贤", "冠铭", "晋玮", "文瑜", "家骏", "彦蓉", "俊仪", "振玮", "雅琦", "姿慧", "宛谕", "宜娟",
			"柏任", "钰茹", "钰珊", "冠群", "书婷", "佳玮", "信杰", "宇婷", "慧慈", "韵竹" };
	

	/**
	 * 随机得到一个姓
	 */
	public String getARandomSurname() {
		String answer = "";
		int num = singleSurnames.length + compoundSurnames.length;
		int randInt = (int) (Math.random() * num);
		if (randInt < singleSurnames.length)
			answer = singleSurnames[randInt];
		else
			answer = compoundSurnames[randInt - singleSurnames.length];
		return answer;
	}

	/**
	 * 随机得到一个单姓
	 */
	public String getARandomSingleSurname() {
		return singleSurnames[(int)(Math.random()*singleSurnames.length)];
	}

	/**
	 * 随机得到一个复姓
	 */
	public String getARandomCompoundSurname() {
		return compoundSurnames[(int)(Math.random()*compoundSurnames.length)];
	}
	/**
	 * 随机得到一个普通名字
	 */
	public String getARandomNomalName() {
		return nomalNames[(int)(Math.random()*nomalNames.length)];
	}
	/**
	 * 随机得到一个普通全名
	 */
	public String getARandomNomalFullname() {
		return this.getARandomSurname()+this.getARandomNomalName();
	}
}
