package fun.wk.staticdata;

public class PlaceName {

	/**
	 * 形容词1
	 */
	public static String[] adj1 = { "瑞", "清", "烈", "炎", "寒", "暗", "赤", "虹", "青", "紫", "白", "玄", "落", "晴", "铁", "恶",
			"天", "灵", "神", "魔", "蚀", "离", "血", "幽", "炼", "夜", "弥", "巫", "静", "孤", "殁", "垂", "梵", "劣", "荒" };
	/**
	 * 名词1
	 */
	public static String[] noun1 = { "阴", "影", "阳", "星", "月", "岩", "石", "云", "雨", "桐", "龙", "虎", "狼", "鬼", "鹰", "皇",
			"凤", "风", "魂", "魄", "骨", "陀" };
	/**
	 * 后缀名1
	 */
	public static String[] nounE = { "浦", "谷", "泽", "湖", "洞", "穴", "山", "林", "墟", "泉", "顶", "峰", "滩", "潭", "崖", "壁",
			"峡", "丘", "坡", "泊", "沟", "壑", "河", "台", "冈", "岭", "崚", "盆地", "草原", "原野", "小径" };

}
